app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)
    if @question.save
---
INSERT INTO "questions" ("question") VALUES ($1) RETURNING "id"  [["question", "How does a polar bear know what apples is?"]]

  def update
    @question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", "1"]]

  def destroy
    @question = Question.find(params[:id])
    @question.delete
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "questions" WHERE "questions"."id" = 1